Notas-de-clase/clase-2022-08-24.md

# Table of Contents

1.  [Java](#org6b67d39)
    1.  [Strings](#orga5ec83e)
        1.  [Sub cadenas](#org00a51d8)
        2.  [Concatenación](#org2c473c2)
    2.  [Integer](#org40aa74f)
    3.  [Java Math](#orgec017da)
        1.  [Math.max()](#org86bc91c)
        2.  [Math.min()](#orgfdd48d1)
        3.  [Math.sqrt()](#org1d972df)



<a id="org6b67d39"></a>

# Java


<a id="orga5ec83e"></a>

## Strings


<a id="org00a51d8"></a>

### Sub cadenas

El método substring recibe las posiciones desde (inclusive) y hasta (no inclusive) entre las cuales se ubica la subcadena que queremos obtener. Si le pasamos un único parámetro substring retornará la subcadena comprendida entre esta posición y el final de la cadena de carácteres.

    String hello = "Hello World";
    System.out.println(hello.substring(0,4)); // Hell
    System.out.println(hello.substring(6,11)); // World
    System.out.println(hello.substring(3,4)); // lo World


<a id="org2c473c2"></a>

### Concatenación

Podemos usar el operador + para concatenar cadenas de caractéres.

    String hello = "Hello ";
    String world = "World";
    String helloWorld = hello + world; // Hello World


<a id="org40aa74f"></a>

## Integer

La clase integer (wrapper de int) nos permite obtener un int a partir de una cadena de caracteres con formato numérico; y viceversa. Análogamente, la clase oOuble (wrapper de double) hace lo propio entre cadenas y números con decimales.


<a id="orgec017da"></a>

## Java Math

La clase Java Math tiene muchos métodos que le permiten realizar tareas matemáticas con números. Algunos de ellos son:


<a id="org86bc91c"></a>

### Math.max()

El método Math.max(x, y) se puede usar para encontrar el valor más alto entre dos valores.

    Math.max(5, 10); // 10


<a id="orgfdd48d1"></a>

### Math.min()

El método Math.max(x, y) se puede usar para encontrar el valor más bajo entre dos valores.

    Math.min(5, 10); // 5


<a id="org1d972df"></a>

### Math.sqrt()

Nos ayuda a obtener la raiz cuadrada de un número

    Math.sqrt(64); // 64
